import pymongo
import random
from random import randrange
from datetime import timedelta

# Хоёр хугацааны хооронд дурын огноо авах


def random_date(start, end):
    delta = end - start
    int_delta = (delta.days * 24 * 60 * 60) + delta.seconds
    random_second = randrange(int_delta)
    return start + timedelta(seconds=random_second)

from datetime import datetime
d1 = datetime.strptime('1/1/2022 8:30 AM', '%m/%d/%Y %I:%M %p')
d2 = datetime.strptime('12/31/2022 05:0 PM', '%m/%d/%Y %I:%M %p')


civil_registers=('УМ90041922','НЭ91041031','ЧТ85030108','УШ70102906','ЧО81091064','КЮ77091501','ЧК77122909','БЭ83081400',
'УХ91051736','ЧЙ83090377','ЗЮ84092117','ЦЗ71061161','УД92041626','УШ91050511','ТЯ87011512','СФ82052518',
'ВЭ86031762','УШ94021959','МЛ67042618','АМ95121733','УП89051007','ПБ96052405','НШ84042064','УЮ90080210',
'ЧО85071915','ЧЗ78072303','УП88081636','ГЮ90101913','РЮ74080802','ЙК91063019','УЮ98081115','УМ89120908',
'ТА98091450','ШГ78081961','ПЗ95050804','ВН97040702','ТГ88112521','ЦЕ84080366','ХА72030734','ЧС57072001',
'ФБ96092526','ЧТ57100401','ЗЮ97061004','РЦ95091515','УС83022014','МЭ78021613','МК84060102','ЧА86010690',
'ЧР79030120','УХ90041574','СЭ87010200','ЧТ75120307','ЕЙ77042113','УШ97031410','ТЕ87092064','УШ95060978',
'ТД85091402','УШ99072516','ЧЗ87032839','ОК97021904','ХЖ70051870','ОЮ93011913','ЧЕ73071106','ЧН84030714',
'УП96052704','УИ91110826','УЗ88100407','ИЗ82031636','ЙЭ84102205','ИН89040106','НВ91050606','ЙМ80013011',
'ЦД86111261','ПИ85092000','ОЗ01281118','ДЭ86060604','ЧГ74052302','ИЭ85012207','ЧМ87012167')

first_names=('Батсайхан','Энхбаатар','Алдаржавхлан','Цэрэн','Энхбаяр','Буянт','Ариунжаргал','Саранцацрал','Ариунаа','Одцэрэн','Однаран',
'Тунгалагмөрөн','Эрдэнэсугар','Бадамгарав','Цэвэлмаа','Мөнхгэрэл','Сарангэрэл','Азжаргал','Янжмаа','Эрдэнэчимэг','Долгор','Энх-Амгалан',
'Мөнхбаатар')
last_names=('Батсайхан','Энхбаатар','Алдаржавхлан','Цэрэн','Энхбаяр','Буянт','Ариунжаргал','Саранцацрал','Ариунаа','Одцэрэн','Однаран',
'Тунгалагмөрөн','Эрдэнэсугар','Бадамгарав','Цэвэлмаа','Мөнхгэрэл','Сарангэрэл','Азжаргал','Янжмаа','Эрдэнэчимэг','Долгор','Энх-Амгалан',
'Мөнхбаатар')

salary_lists=(1200000, 1500000, 3000000, 4000000, 1800000, 5000000, 2500000, 2100000, 800000, 1000000, 10000000, 12000000, 15000000, 20000000)

work_months=(1,3,6,12,24,36,18)

client = pymongo.MongoClient("mongodb://localhost:27017/")
db = client["mydatabase"]
collection = db["mycollection"]

# id_seq = collection.find().count()

for i in range(100):
    
    salary = random.choice(salary_lists)
    work_month = random.choice(work_months)
    # id_seq = id_seq + 1
    
    doc = { 
#           "_id" : id_seq,
           "_id" : i,
           "created" : random_date(d1, d2),
           "name" : { "first_name" : random.choice(first_names), 
                      "last_name" : random.choice(last_names)
                    }, 
           "register_num" : random.choice(civil_registers),            
        "Эрүүл мэнд, нийгмийн даатгалын шимтгэл" : {
            "Хөдөлмөрийн хөлс,түүнтэй адилтгах орлого /төгрөг/" : salary, 
            "НДШ хувь хэмжээ": 25, 
            "Ногдуулсан шимтгэл/төгрөг/ - Нийт дүн": salary * 0.25, 
            "Ажил олгогчийн төлөх хувь хэмжээ" : 13.5,
            "Үүнээс : Ажил олгогч" : salary * 0.135, 
            "Даатгуулагчийн төлөх хувь хэмжээ" : 11.5, 
            "Үүнээс : Даатгуулагч" : salary * 0.115            
        }, 
        "Татварын тооцоолол жилээр" : {
            "Жилийн нийт орлого" : salary * work_month, 
            "Орлого хүлээн авсан сарын тоо /ажилласан сар/" : work_month, 
            "Сарын дундаж" : salary, 
            "ЭМД, НДШ Хувь" : 11.5, 
            "ЭМД, НДШ Дүн" :  salary * work_month * 0.115, 
            "Татвар ногдуулах орлого" : salary * work_month * (1 - 0.115), 
            "Ногдуулсан татварын хувь хэмжээ" :	10,
            "Ногдуулсан татвар" :	 salary * work_month * (1 - 0.115) * 0.10, 
            "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох" :	18000,
            "Хуулийн 23.1-т заасан хөнгөлөлт нийт" : 18000 * work_month,
            "Хөнгөлөлтийн дараах татварын дүн" : salary * work_month * (1 - 0.115) - 18000 * work_month,
            "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн" :	0,
            "Нийт суутгуулсан албан татварын дүн" :	 salary * work_month * (1 - 0.115) - 18000 * work_month
        }
	}
    
   # doc = {"name": "John", "age": i}
    collection.insert_one(doc)

for doc in collection.find():
    print(doc)