import pymongo
import random
from random import randrange
from datetime import timedelta

# Хоёр хугацааны хооронд дурын огноо авах


def random_date(start, end):
    delta = end - start
    int_delta = (delta.days * 24 * 60 * 60) + delta.seconds
    random_second = randrange(int_delta)
    return start + timedelta(seconds=random_second)

from datetime import datetime
d1 = datetime.strptime('1/1/2022 8:30 AM', '%m/%d/%Y %I:%M %p')
d2 = datetime.strptime('12/31/2022 05:0 PM', '%m/%d/%Y %I:%M %p')




first_names=('Батсайхан','Энхбаатар','Алдаржавхлан','Цэрэн','Энхбаяр','Буянт','Ариунжаргал','Саранцацрал','Ариунаа','Одцэрэн','Однаран',
'Тунгалагмөрөн','Эрдэнэсугар','Бадамгарав','Цэвэлмаа','Мөнхгэрэл','Сарангэрэл','Азжаргал','Янжмаа','Эрдэнэчимэг','Долгор','Энх-Амгалан',
'Мөнхбаатар')
last_names=('Батсайхан','Энхбаатар','Алдаржавхлан','Цэрэн','Энхбаяр','Буянт','Ариунжаргал','Саранцацрал','Ариунаа','Одцэрэн','Однаран',
'Тунгалагмөрөн','Эрдэнэсугар','Бадамгарав','Цэвэлмаа','Мөнхгэрэл','Сарангэрэл','Азжаргал','Янжмаа','Эрдэнэчимэг','Долгор','Энх-Амгалан',
'Мөнхбаатар')

client = pymongo.MongoClient("mongodb://localhost:27017/")
db = client["mydatabase"]
collection = db["mycollection"]



for i in range(100):
    
    
    
    doc = { 
           "_id" : i, 
           "created" : random_date(d1, d2),
           "name" : { "first_name" : random.choice(first_names), 
                      "last_name" : random.choice(last_names)
                    }, 
           "register_num" : "УХ03222644",            
        "Эрүүл мэнд, нийгмийн даатгалын шимтгэл" : {
            "Хөдөлмөрийн хөлс,түүнтэй адилтгах орлого /төгрөг/" : 1315789.47 * i, 
            "НДШ хувь хэмжээ": 25, 
            "Ногдуулсан шимтгэл/төгрөг/ - Нийт дүн": 328947.3675 * i, 
            "Ажил олгогчийн төлөх хувь хэмжээ" : 13.5,
            "Үүнээс : Ажил олгогч" : 177631.5785 * i, 
            "Даатгуулагчийн төлөх хувь хэмжээ" : 11.5 * i, 
            "Үүнээс : Даатгуулагч" : 151315.7891 * i            
        }, 
        "Татварын тооцоолол жилээр" : {
            "Жилийн нийт орлого" : 10260000.00 * i, 
            "Орлого хүлээн авсан сарын тоо /ажилласан сар/" : 12.00, 
            "Сарын дундаж" : 855000 * i, 
            "ЭМД, НДШ Хувь" : 11.5, 
            "ЭМД, НДШ Дүн" :  1179900.00 * i, 
            "Татвар ногдуулах орлого" : 9080100.00 * i, 
            "Ногдуулсан татварын хувь хэмжээ" :	10,
            "Ногдуулсан татвар" :	 908010.00 * i, 
            "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох" :	18000 * i,
            "Хуулийн 23.1-т заасан хөнгөлөлт нийт" :	216000 * i,
            "Хөнгөлөлтийн дараах татварын дүн" :	 692010.00 * i,
            "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн" :	0 * i,
            "Нийт суутгуулсан албан татварын дүн" :	 692010.00 * i            
        }
	}
    
   # doc = {"name": "John", "age": i}
    collection.insert_one(doc)




for doc in collection.find():
    print(doc)